mikaelpatel/Cosa/boards.txt
pro-mini-8.build.mcu=atmega328p
pro-mini-8.build.f_cpu=8000000L
pro-mini-8.build.board=ARDUINO_PRO_MINI
pro-mini-8.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
uno.name=Cosa Arduino Uno (ATmega328/Optiboot)
uno.upload.tool=avrdude
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.maximum_data_size=2048
uno.upload.speed=115200

uno.bootloader.tool=avrdude
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05

uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.board=ARDUINO_UNO
uno.build.core=cosa

##
# BREADBOARDS
##

# AVR:ATtiny84
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny84-8.name=Cosa Breadboard (ATtiny84, 8 MHz internal clock)
attiny84-8.upload.using=arduino:arduinoisp
attiny84-8.upload.tool=arduino:arduinoisp
attiny84-8.upload.maximum_size=8192
attiny84-8.upload.maximum_data_size=512

attiny84-8.bootloader.tool=arduino:arduinoisp
attiny84-8.bootloader.low_fuses=0xe2
attiny84-8.bootloader.high_fuses=0xdf
attiny84-8.bootloader.extended_fuses=0xff

attiny84-8.build.mcu=attiny84
attiny84-8.build.f_cpu=8000000L
attiny84-8.build.board=BREADBOARD_ATTINYX4
attiny84-8.build.core=cosa

# AVR:ATtiny85
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny85-8.name=Cosa Breadboard (ATtiny85, 8 MHz internal clock)
attiny85-8.upload.using=arduino:arduinoisp
attiny85-8.upload.tool=arduino:arduinoisp
attiny85-8.upload.maximum_size=8192
attiny85-8.upload.maximum_data_size=512

attiny85-8.bootloader.tool=arduino:arduinoisp
attiny85-8.bootloader.low_fuses=0xe2
attiny85-8.bootloader.high_fuses=0xdf
attiny85-8.bootloader.extended_fuses=0xff

attiny85-8.build.mcu=attiny85
attiny85-8.build.f_cpu=8000000L
attiny85-8.build.board=BREADBOARD_ATTINYX5
attiny85-8.build.core=cosa

# AVR:ATtiny861
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny861-8.name=Cosa Breadboard (ATtiny861, 8 MHz internal clock)
attiny861-8.upload.using=arduino:arduinoisp
attiny861-8.upload.tool=arduino:arduinoisp
attiny861-8.upload.maximum_size=8192
attiny861-8.upload.maximum_data_size=512

attiny861-8.bootloader.tool=arduino:arduinoisp
attiny861-8.bootloader.low_fuses=0xe2
attiny861-8.bootloader.high_fuses=0xdf
attiny861-8.bootloader.extended_fuses=0x01

attiny861-8.build.mcu=attiny861
attiny861-8.build.f_cpu=8000000L
attiny861-8.build.board=BREADBOARD_ATTINYX61
attiny861-8.build.core=cosa

# AVR:ATmega328
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
atmega328-8.name=Cosa Breadboard (ATmega328, 8 MHz internal clock)
atmega328-8.upload.using=arduino:arduinoisp
atmega328-8.upload.tool=arduino:arduinoisp
# atmega328-8.upload.protocol=usbasp
atmega328-8.upload.maximum_size=32256
atmega328-8.upload.speed=115200

atmega328-8.bootloader.tool=arduino:arduinoisp
atmega328-8.bootloader.low_fuses=0xE2
atmega328-8.bootloader.high_fuses=0xDE
atmega328-8.bootloader.extended_fuses=0xFD

atmega328-8.build.mcu=atmega328p
atmega328-8.build.f_cpu=8000000L
atmega328-8.build.board=BREADBOARD_ATMEGA328P
atmega328-8.build.core=cosa

# AVR:ATmega1284
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0xfc00). 
mighty.name=Cosa Breadboard (ATmega1284/BOOT_1284P)
mighty.upload.tool=avrdude
mighty.upload.protocol=stk500v1
mighty.upload.maximum_size=129024
mighty.upload.maximum_data_size=16384
mighty.upload.speed=57600

mighty.bootloader.tool=avrdude
mighty.bootloader.low_fuses=0xff
mighty.bootloader.high_fuses=0xdc
mighty.bootloader.extended_fuses=0xfd

mighty.build.mcu=atmega1284p
mighty.build.f_cpu=16000000L
mighty.build.board=BREADBOARD_ATMEGA1284
mighty.build.core=cosa

# AVR:ATmega1284
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0xfe00). 
mighty-opt.name=Cosa Breadboard (ATmega1284/Optiboot)
mighty-opt.upload.tool=avrdude
mighty-opt.upload.protocol=arduino
mighty-opt.upload.maximum_size=130048
mighty-opt.upload.maximum_data_size=16384
mighty-opt.upload.speed=115200

mighty-opt.bootloader.tool=avrdude
mighty-opt.bootloader.low_fuses=0xff
mighty-opt.bootloader.high_fuses=0xde
mighty-opt.bootloader.extended_fuses=0xfd

mighty-opt.build.mcu=atmega1284p
mighty-opt.build.f_cpu=16000000L
mighty-opt.build.board=BREADBOARD_ATMEGA1284
mighty-opt.build.core=cosa

##
# LILYPAD ARDUINO BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
lilypad.name=Cosa LilyPad Arduino (ATmega328/BOOT_168, 8 MHz)
lilypad.upload.tool=avrdude
lilypad.upload.protocol=arduino
lilypad.upload.maximum_size=30720
lilypad.upload.maximum_data_size=2048
lilypad.upload.speed=57600

lilypad.bootloader.tool=avrdude
lilypad.bootloader.low_fuses=0xff
lilypad.bootloader.high_fuses=0xda
lilypad.bootloader.extended_fuses=0x05

lilypad.build.mcu=atmega328p
lilypad.build.f_cpu=8000000L
lilypad.build.board=LILYPAD_ARDUINO
lilypad.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.0 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
lilypad-usb.name=Cosa LilyPad Arduino USB (ATmega32U4/Caterina, 8 MHz)
lilypad-usb.upload.tool=avrdude
lilypad-usb.upload.protocol=avr109
lilypad-usb.upload.maximum_size=28672
lilypad-usb.upload.maximum_data_size=2560
lilypad-usb.upload.speed=57600
lilypad-usb.upload.disable_flushing=true
lilypad-usb.upload.use_1200bps_touch=true
lilypad-usb.upload.wait_for_upload_port=true

lilypad-usb.bootloader.tool=avrdude
lilypad-usb.bootloader.low_fuses=0xff
lilypad-usb.bootloader.high_fuses=0xd8
lilypad-usb.bootloader.extended_fuses=0xce

lilypad-usb.build.mcu=atmega32u4
lilypad-usb.build.f_cpu=8000000L
lilypad-usb.build.vid=0x1B4F
lilypad-usb.build.pid=0x9208
lilypad-usb.usb_product="Arduino LilyPad USB"
lilypad-usb.build.board=LILYPAD_ARDUINO_USB
lilypad-usb.build.core=cosa
lilypad-usb.build.extra_flags={build.usb_flags}

