mikaelpatel/Cosa/boards.txt
##
# PINOCCIO BOARDS
##

# AVR:Pinoccio
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000). 
pinoccio.name=Cosa Pinoccio Scout (ATmega256RFR2/STK500v2)
pinoccio.upload.tool=avrdude
pinoccio.upload.protocol=wiring
pinoccio.upload.maximum_size=253952
pinoccio.upload.maximum_data_size=32768
pinoccio.upload.speed=115200

pinoccio.bootloader.tool=avrdude
pinoccio.bootloader.low_fuses=0xff
pinoccio.bootloader.high_fuses=0xd0
pinoccio.bootloader.extended_fuses=0xfe

pinoccio.build.mcu=atmega256rfr2
pinoccio.build.f_cpu=16000000L
pinoccio.build.board=PINOCCIO_SCOUT
pinoccio.build.core=cosa

##
# MICRODUINO CORE MODULES
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
microduino-core.name=Cosa Microduino-Core (ATmega328/Optiboot)
microduino-core.upload.tool=avrdude
microduino-core.upload.protocol=arduino
microduino-core.upload.maximum_size=32256
microduino-core.upload.maximum_data_size=2048
microduino-core.upload.speed=115200

microduino-core.bootloader.tool=avrdude
microduino-core.bootloader.low_fuses=0xff
microduino-core.bootloader.high_fuses=0xde
microduino-core.bootloader.extended_fuses=0x05

microduino-core.build.mcu=atmega328p
microduino-core.build.f_cpu=16000000L
microduino-core.build.board=MICRODUINO_CORE
microduino-core.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
microduino-core32u4.name=Cosa Microduino-Core32u4 (ATmega32U4/Caterina)
microduino-core32u4.upload.tool=avrdude
microduino-core32u4.upload.protocol=avr109
microduino-core32u4.upload.maximum_size=28672
microduino-core32u4.upload.maximum_data_size=2560
microduino-core32u4.upload.speed=57600
microduino-core32u4.upload.disable_flushing=true
microduino-core32u4.upload.use_1200bps_touch=true
microduino-core32u4.upload.wait_for_upload_port=true

microduino-core32u4.bootloader.tool=avrdude
microduino-core32u4.bootloader.low_fuses=0xff
microduino-core32u4.bootloader.high_fuses=0xd8
microduino-core32u4.bootloader.extended_fuses=0xcb

microduino-core32u4.build.mcu=atmega32u4
microduino-core32u4.build.f_cpu=16000000L
microduino-core32u4.build.vid=0x2341
microduino-core32u4.build.pid=0x8036
microduino-core32u4.build.core=cosa
microduino-core32u4.build.usb_product="Microduino Core32u4"
microduino-core32u4.build.board=MICRODUINO_CORE32U4
microduino-core32u4.build.extra_flags={build.usb_flags}

# AVR:ATmega644P
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0xfe00). 
microduino-core-plus.name=Cosa Microduino-Core+ (ATmega644P/Optiboot)
microduino-core-plus.upload.tool=avrdude
microduino-core-plus.upload.protocol=arduino
microduino-core-plus.upload.maximum_size=64512
microduino-core-plus.upload.maximum_data_size=4096
microduino-core-plus.upload.speed=115200

microduino-core-plus.bootloader.tool=avrdude
microduino-core-plus.bootloader.low_fuses=0xff
microduino-core-plus.bootloader.high_fuses=0xde
microduino-core-plus.bootloader.extended_fuses=0xfd

microduino-core-plus.build.mcu=atmega644p
microduino-core-plus.build.f_cpu=16000000L
microduino-core-plus.build.board=MICRODUINO_CORE_PLUS
microduino-core-plus.build.core=cosa

##
# TEENSY BOARDS
##

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
teensy-2_0.name=Cosa Teensy 2.0 (ATmega32U4/halfkay)
teensy-2_0.upload.tool=teensy_reboot
teensy-2_0.upload.protocol=halfkay
teensy-2_0.upload.maximum_size=32256
teensy-2_0.upload.maximum_data_size=2560
teensy-2_0.upload.speed=12000000
teensy-2_0.upload.disable_flushing=true

teensy-2_0.build.mcu=atmega32u4
teensy-2_0.build.f_cpu=16000000L
teensy-2_0.build.vid=0x16C0
teensy-2_0.build.pid=0x0483
teensy-2_0.build.usb_product="Teensy 2.0"
teensy-2_0.build.board=PJRC_TEENSY_2_0
teensy-2_0.build.core=cosa
teensy-2_0.build.extra_flags={build.usb_flags}

# AVR:AT90USB1286
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
teensypp-2_0.name=Cosa Teensy++ 2.0 (AT90USB1286/halfkay)
teensypp-2_0.upload.tool=teensy_reboot
teensypp-2_0.upload.protocol=halfkay
teensypp-2_0.upload.maximum_size=130048
teensypp-2_0.upload.maximum_data_size=8192
teensypp-2_0.upload.speed=12000000
teensypp-2_0.upload.disable_flushing=true

teensypp-2_0.build.mcu=at90usb1286
teensypp-2_0.build.f_cpu=16000000L
teensypp-2_0.build.vid=0x16C0
teensypp-2_0.build.pid=0x0483
teensypp-2_0.build.usb_product="Teensy++ 2.0"
teensypp-2_0.build.board=PJRC_TEENSYPP_2_0
teensypp-2_0.build.core=cosa
teensypp-2_0.build.extra_flags={build.usb_flags}
